tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Run your GitHub Actions locally
brew "act"
# YAML Parser
brew "libyaml"
# Automate deployment, configuration, and upgrading
brew "ansible"
# TIFF library and utilities
brew "libtiff"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
# brew "docker"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Charset analyzer and converter
brew "enca"
# Run arbitrary commands when files change
brew "entr"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
# brew "ghostscript"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Postgres C API library
brew "libpq"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
# brew "mysql@5.7", restart_service: true, link: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Platform built on V8 to build network applications
brew "node@14"
# Development kit for the Java programming language
brew "openjdk@11"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
# brew "postgresql@13", link: true
# Object-relational database system
brew "postgresql@15", restart_service: true
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Encrypt/decrypt using SSH keys
brew "ssh-vault"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Watch files and take action when they change
brew "watchman"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# JavaScript package manager
brew "yarn"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-inconsolata"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
# Free and open-source image editor
cask "gimp"
# Open-source keystroke visualizer
cask "keycastr"
cask "mattr-slate"
# Development environment
# cask "vagrant"
cask "google-chrome"
cask "google-drive"
cask "orbstack"
cask "alfred"
cask "spectacle"
cask "heptabase"
cask "iina"
cask "setapp"
cask "1password"
cask "slack"
cask "discord"
cask "telegram"
cask "notion"
cask "obsidian"
cask "postman"
cask "vlc"
cask "calibre"
cask "visual-studio-code"
cask "iterm2"
cask "spotify"
vscode "asvetliakov.vscode-neovim"
vscode "eamodio.gitlens"
vscode "extr0py.vscode-relative-line-numbers"
vscode "jakebecker.elixir-ls"
vscode "karunamurti.haml"
vscode "marp-team.marp-vscode"
vscode "mhutchie.git-graph"
vscode "mjmcloug.vscode-elixir"
vscode "ms-vsliveshare.vsliveshare"
vscode "rebornix.ruby"
vscode "ritwickdey.liveserver"
vscode "sianglim.slim"
vscode "standard.vscode-standard"
