tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "act"
brew "cryptography"
brew "libyaml"
brew "ansible"
brew "ansible-lint"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "unixodbc"
brew "asdf"
brew "autojump"
brew "aws-vault"
brew "awscli"
brew "icu4c"
brew "boost"
brew "glib"
brew "cmake"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "enca"
brew "entr"
brew "fd"
brew "pmix"
brew "freetds"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gpgme"
brew "guile"
brew "harfbuzz"
brew "highlight"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "libpq"
brew "pango"
brew "librsvg"
brew "libxslt"
brew "macvim"
brew "node"
brew "mongosh"
brew "neovim"
brew "nghttp2"
brew "python@3.10"
brew "node@14"
brew "node@16"
brew "openjdk@11"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "postgresql@15", restart_service: true
brew "pre-commit"
brew "protobuf"
brew "qpdf"
brew "ripgrep"
brew "ssh-vault"
brew "sshuttle"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "unzip"
brew "vips"
brew "watchman"
brew "wxwidgets"
brew "yarn"
brew "zplug"
brew "zsh"
brew "hashicorp/tap/terraform"
cask "1password"
cask "1password-cli"
cask "arc"
cask "calibre"
cask "chromedriver"
cask "discord"
cask "dropbox"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "heptabase"
cask "iina"
cask "iterm2"
cask "keycastr"
cask "mattr-slate"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "slack"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
