tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "openssl@1.1"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "autojump"
brew "curl"
brew "entr"
brew "fzf"
brew "ghostscript"
brew "git"
brew "glib"
brew "gnutls"
brew "gnupg"
brew "highlight"
brew "imagemagick"
brew "libxml2"
brew "libxslt"
brew "macvim"
brew "mysql@5.7", restart_service: true
brew "openjdk@11"
brew "postgresql", restart_service: true
brew "postgresql@12"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"
brew "tree"
brew "unzip"
brew "watchman"
brew "wxmac"
brew "yarn"
brew "zplug"
brew "zsh"
brew "heroku/brew/heroku"
cask "chromedriver"
cask "font-hack-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
cask "mattr-slate"
